Revit 2026 API

# CorrectionFactorSetGetEnumerator Method

---

Retrieve a forward moving iterator to the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator
```
```cpp
public:
virtual IEnumerator^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator
override GetEnumerator : unit -> IEnumerator
```

#### Return Value

IEnumeratorReturns a forward moving iterator to the set.

#### Implements

IEnumerableGetEnumerator

#### Reference

CorrectionFactorSet Class

Autodesk.Revit.DB.Electrical Namespace